Results/Swarm/13-01-22/12/swarm-sn-wrk-mixed-c6525-25g-exp12-havail0-hori1-verti1-infi1-client1-t4-c512-d30-R1500
Using argument nginx
using  args: threads=4 and connections=512 and duration=30 and requests=1500
Running 30s test @ http://10.10.1.8:8080
  4 threads and 512 connections
  Thread calibration: mean lat.: 1.572ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.558ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.520ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.538ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.47ms    1.59ms   5.89ms   58.52%
    Req/Sec   392.41    203.20     0.90k    70.61%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.88ms
 75.000%    3.79ms
 90.000%    4.34ms
 99.000%    5.89ms
 99.900%    7.57ms
 99.990%    9.10ms
 99.999%    9.73ms
100.000%    9.73ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.386     0.000000            1         1.00
       0.568     0.100000         2978         1.11
       0.821     0.200000         5947         1.25
       0.924     0.300000         8887         1.43
       1.124     0.400000        11853         1.67
       2.879     0.500000        14813         2.00
       3.201     0.550000        16295         2.22
       3.393     0.600000        17774         2.50
       3.549     0.650000        19272         2.86
       3.671     0.700000        20741         3.33
       3.791     0.750000        22216         4.00
       3.857     0.775000        22970         4.44
       3.927     0.800000        23708         5.00
       4.001     0.825000        24452         5.71
       4.093     0.850000        25180         6.67
       4.199     0.875000        25922         8.00
       4.259     0.887500        26297         8.89
       4.339     0.900000        26665        10.00
       4.423     0.912500        27035        11.43
       4.515     0.925000        27402        13.33
       4.643     0.937500        27781        16.00
       4.715     0.943750        27956        17.78
       4.795     0.950000        28143        20.00
       4.891     0.956250        28331        22.86
       4.995     0.962500        28517        26.67
       5.131     0.968750        28697        32.00
       5.211     0.971875        28787        35.56
       5.287     0.975000        28881        40.00
       5.371     0.978125        28974        45.71
       5.467     0.981250        29066        53.33
       5.579     0.984375        29159        64.00
       5.655     0.985938        29205        71.11
       5.735     0.987500        29252        80.00
       5.827     0.989062        29298        91.43
       5.931     0.990625        29343       106.67
       6.039     0.992188        29389       128.00
       6.107     0.992969        29412       142.22
       6.179     0.993750        29435       160.00
       6.279     0.994531        29459       182.86
       6.423     0.995313        29483       213.33
       6.555     0.996094        29505       256.00
       6.631     0.996484        29516       284.44
       6.739     0.996875        29528       320.00
       6.871     0.997266        29541       365.71
       6.959     0.997656        29551       426.67
       7.159     0.998047        29563       512.00
       7.191     0.998242        29568       568.89
       7.239     0.998437        29574       640.00
       7.359     0.998633        29580       731.43
       7.507     0.998828        29586       853.33
       7.615     0.999023        29592      1024.00
       7.787     0.999121        29594      1137.78
       7.895     0.999219        29597      1280.00
       7.959     0.999316        29600      1462.86
       8.067     0.999414        29603      1706.67
       8.287     0.999512        29606      2048.00
       8.367     0.999561        29607      2275.56
       8.495     0.999609        29609      2560.00
       8.623     0.999658        29610      2925.71
       8.727     0.999707        29612      3413.33
       8.775     0.999756        29613      4096.00
       8.831     0.999780        29614      4551.11
       8.919     0.999805        29615      5120.00
       8.919     0.999829        29615      5851.43
       9.039     0.999854        29616      6826.67
       9.095     0.999878        29617      8192.00
       9.095     0.999890        29617      9102.22
       9.119     0.999902        29618     10240.00
       9.119     0.999915        29618     11702.86
       9.119     0.999927        29618     13653.33
       9.303     0.999939        29619     16384.00
       9.303     0.999945        29619     18204.44
       9.303     0.999951        29619     20480.00
       9.303     0.999957        29619     23405.71
       9.303     0.999963        29619     27306.67
       9.727     0.999969        29620     32768.00
       9.727     1.000000        29620          inf
#[Mean    =        2.474, StdDeviation   =        1.592]
#[Max     =        9.720, Total count    =        29620]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  44332 requests in 30.01s, 213.38MB read
  Socket errors: connect 0, read 0, write 0, timeout 22
Requests/sec:   1477.49
Transfer/sec:      7.11MB